{"config": [{"config": {"arguments": {}, "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00bb\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_3", "trainable": true, "output_shape": [64, 64, 3], "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"subsample": [4, 4], "name": "convolution2d_7", "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_col": 5, "nb_filter": 16}, "class_name": "Convolution2D"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "name": "convolution2d_8", "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_row": 3, "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_col": 3, "nb_filter": 32}, "class_name": "Convolution2D"}, {"config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"subsample": [2, 2], "name": "convolution2d_9", "activation": "linear", "b_regularizer": null, "bias": true, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "init": "glorot_uniform", "nb_row": 5, "b_constraint": null, "activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "nb_col": 5, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": 1024, "bias": true, "name": "dense_5", "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 512, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "activation": "linear", "b_regularizer": null, "input_dim": 512, "bias": true, "name": "dense_6", "trainable": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}